[
  {
    "slug": "legal-demand-notice",
    "title": "Legal Demand Notice",
    "body": "Date: {{date}}\n\nTo:\n{{toParty}}\n{{recipientAddress}}\n\nFrom:\n{{fromLawyer}}\n[Lawyer's Address]\n[Lawyer's Contact Information]\n\nSubject: Legal Demand Notice for {{claimDetails}}\n\nDear {{toParty}},\n\nUnder instructions from my client, I am hereby issuing you this legal notice in connection with {{claimDetails}}.\n\nMy client has been continuously requesting you to fulfill your obligations, however, despite several reminders, you have failed to comply with the same. This non-compliance has caused my client significant loss and inconvenience.\n\nYou are hereby called upon to immediately take necessary steps to resolve the matter within {{days}} days from the receipt of this notice. Failing to do so shall compel my client to initiate appropriate legal proceedings against you at your sole risk, cost, and consequences.\n\nThis notice is being sent without prejudice to any other legal rights and remedies available to my client.\n\nA copy of this notice is retained for record and future legal action.\n\nSincerely,\n\n(Signature)\n\n{{fromLawyer}}\n[Designation, e.g., Advocate]\nOn behalf of [Client Name]",
    "placeholders": ["toParty", "fromLawyer", "claimDetails", "date", "recipientAddress", "days"]
  },
  {
    "slug": "payment-reminder",
    "title": "Payment Reminder Notice",
    "body": "Date: {{date}}\nRef. No.: {{refNo}}\n\nFrom:\n{{lawyerName}}\n{{lawyerAddress}}\n{{lawyerPhone}}\n{{lawyerEmail}}\n\nTo:\n{{recipientName}}\n{{recipientAddress}}\n\nSubject: Legal Notice for recovery of outstanding payment of ₹{{amount}}/- due towards my client, {{companyName}}.\n\nDear {{recipientName}} or Sir/Madam,\n\nUnder the instructions and on behalf of my client, {{companyName}}, having their registered office/residence at {{yourAddress}} (hereinafter referred to as \"my client\"), I do hereby serve you with the following legal notice:\n\nThat my client is engaged in the business of {{businessDescription}}.\n\nThat pursuant to an agreement/order dated {{agreementDate}}, you availed the services of/purchased goods from my client. My client provided you with [Specify the service rendered or goods supplied] (hereinafter \"the Services/Goods\").\n\nThat my client duly performed all their obligations and duties as per the terms of the agreement and to your satisfaction. In lieu of the same, my client raised the following invoice(s):\n\nInvoice Details:\n{{invoiceDetails}}\n\nThat the total outstanding amount due and payable by you to my client is ₹{{amount}} ([Total Outstanding Amount in Words]).\n\nThat despite my client fulfilling their commitments, you have failed, neglected, and/or refused to make the aforesaid payment. My client has sent you numerous reminders through emails, letters, and phone calls dated [Dates of previous communications, if any], but you have failed to clear the outstanding dues, without any valid reason or justification.\n\nYour failure to clear the dues has caused significant financial loss and hardship to my client.\n\nYou are hereby called upon to pay my client the total outstanding principal sum of ₹{{amount}} ([Total Outstanding Amount in Words]) within {{days}} days from the receipt of this legal notice.\n\nThe payment can be made via cheque/demand draft in favour of `{{companyName}}` or via bank transfer to the following account:\n\nBank Name: {{bankName}}\nAccount Holder: {{accountHolder}}\nAccount Number: {{accountNumber}}\nIFSC Code: {{ifscCode}}\n\nKindly note that should you fail to comply with the requisitions made herein within the stipulated period, my client shall be constrained to initiate appropriate legal proceedings against you, both civil and criminal (where applicable), for the recovery of the aforesaid amount along with interest, damages, and costs. In such an event, you shall be solely responsible for all costs and consequences thereof.\n\nA copy of this notice has been retained in my office for record and further action.\n\nSincerely,\n\n(Signature)\n\n[Name of the Lawyer/Sender]\n[Designation, e.g., Advocate]\nOn behalf of {{companyName}}",
    "placeholders": [
      "date",
      "refNo",
      "lawyerName",
      "lawyerAddress",
      "lawyerPhone",
      "lawyerEmail",
      "recipientName",
      "recipientAddress",
      "amount",
      "companyName",
      "businessDescription",
      "agreementDate",
      "invoiceDetails",
      "yourAddress",
      "bankName",
      "accountHolder",
      "accountNumber",
      "ifscCode",
      "days"
    ]
  },
  {
    "slug": "termination-notice",
    "title": "Termination Notice",
    "body": "Date: {{date}}\n\nTo:\n{{toEmployee}}\n[Employee's Address]\n[Employee's Contact Information]\n\nFrom:\n{{fromCompany}}\n[Company's Address]\n[Company's Contact Information]\n\nSubject: Termination of Employment\n\nDear {{toEmployee}},\n\nThis letter serves as a formal notice of termination of your employment with {{fromCompany}}, effective from {{date}}.\n\nThe reason for termination is as follows:\n{{reason}}\n\nDespite prior discussions and warnings, there has been no satisfactory improvement/resolution. As a result, the management has decided to terminate your employment as per the terms and conditions outlined in your employment contract.\n\nFinal settlements, including dues, salary, and any other benefits, will be processed as per company policy and applicable labor laws. You are requested to return any company property in your possession, including identification cards, electronic devices, documents, etc., on or before your last working day.\n\nPlease acknowledge the receipt of this termination letter and contact the HR department for any clarifications regarding your final settlements.\n\nWe wish you the best for your future endeavors.\n\nSincerely,\n\n(Signature)\n\n[Authorized Signatory Name]\n[Designation]\n{{fromCompany}}",
    "placeholders": ["toEmployee", "fromCompany", "reason", "date"]
  }
]
